Revit 2027 API
Wall.GetValidWrappingLocationIndices Method
 Gets all valid locations for end wrapping.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<int> GetValidWrappingLocationIndices()
Public Function GetValidWrappingLocationIndices As IList(Of Integer)
public:
IList<int>^ GetValidWrappingLocationIndices()
member GetValidWrappingLocationIndices : unit -> IList<int>
Return Value
IList<Int32>
 The list of valid wrapping locations.
Remarks
 All valid wrapping locations include wall's two ends and locations on vertical faces of openings or profiles without join.
See Also
Reference
Wall Class
Autodesk.Revit.DB Namespace